#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>
#include<stdlib.h>

//选择语句

//int main()
//{
//	int input = 0;
//	printf("加入比特\n");
//	printf("你要学习吗?\n");
//
//	scanf("%d", &input);
//
//	if (input == 0)
//	{
//		printf("放弃学习\n");
//	}
//
//	else if (input == 1)
//	{
//		printf("好offer\n");
//	}
//
//	system("pause");
//	return 0;
//}


//循环语句

//int main()
//{
//	int line = 0;
//	printf("加入比特\n");
//
//	while (line <= 20000)
//	{
//		printf("我要敲代码\n");
//		line++;
//	}
//
//	if (line > 20000)
//	{
//		printf("找工作\n");
//	}
//
//	else
//	{
//		printf("中途放弃\n");
//	}
//
//
//	system("pause");
//	return 0;


//函数

//int Add(int x, int y)
//{
//	//int z = x + y;
//	//return z;
//
//
//	return x + y;
//}
//
//int main()
//{
//	int num1 = 20;
//	int num2 = 10;
//
//	int sum = Add(num1,num2);
//	printf("%d\n", sum);
//
//	sum = Add(2, 3);
//	printf("%d\n", sum);
//
//	system("pause");
//	return 0;
//}


//数组

//int main()
//{
//	int arr[10] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };
//	//printf("%d\n", arr[4]);
//
//	int i = 0;
//
//	int sz = sizeof(arr) / sizeof(arr[0]);
//
//	while (i < sz)
//	{
//		printf("%d ", arr[i]);
//		i++;
//	}
//
//	system("pause");
//	return 0;
//}



//移位操作符

//int main()
//{
//	//int a = 5 / 2;//a=2
//	//float a = 5 / 2.0;//a=2.5
//	//printf("%d\n", a);
//	//int a = 5 % 2;//a=1
//	//printf("%d\n", a);
//
//
//	//移位
//
//	//int a = 15;
//	//int b = a << 1;
//	//printf("%d\n", b);
//
//	//<<移位操作符----移动的是二进制位
//	//15的二进制数 00000000 00000000 00000000 00001111--原码-反码-补码相同(正数)
//	//向左移一位
//	//00000000 00000000 00000000 00011110
//	//输出30
//	//-1
//	//00000000 00000000 00000000 00000001-原码
//	//11111111 11111111 11111111 11111110-反码
//	//11111111 11111111 11111111 11111111-补码
//
//
//	int a = 15;
//	int b = a >> 1;
//
//	printf("%d\n", b);//b=7
//
//	system("pause");
//	return 0;
//}




//位操作符

//int main()
//{
//	int a = 5;
//	int b = 3;
//	//按位与
//
//	//int c = a&b;//按(二进制)位与
//
//	//printf("%d\n", c);
//
//	//5--- 00000000 00000000 00000000 00000101
//	//3--- 00000000 00000000 00000000 00000011
//	//按位与--1,0为0   1,1为1   0,0为0
//	//按位与的结果
//	//00000000 00000000 00000000 00000001-----1
//
//	//按位或
//
//	//int c = a | b;
//	//printf("%d\n", c);
//
//	//按位或--有1为1
//	//按位或的结果
//	//00000000 00000000 00000000 00000111-----7
//
//
//	//按位异或
//
//	//int c = a^b;
//	//printf("%d\n", c);
//
//	//按位异或--相同为0，相反为1
//	//按位异或的结果
//	//00000000 00000000 00000000 00000110-----6
//
//	system("pause");
//	return 0;
//}


//int main()
//{
//	int a = 10;
//
//	//!---逻辑反操作
//	//printf("%d\n", !a);
//
//	//~---对一个数的二进制按位取反
//	printf("%d\n", ~a);
//
//	//10---00000000 00000000 00000000 00001010
//	//取反-11111111 11111111 11111111 11110101---补码
//	//减一-11111111 11111111 11111111 11110100
//	//取反-10000000 00000000 00000000 00001011---(符号位不变)
//	//-11
//
//	system("pause");
//	return 0;
//}


int main()
{
	int a = 10;
	//int b = a++;//后置++
	////先使用，后++
	////将a的值先赋给b
	////b=10;
	////再++
	////a=11;
	//printf("%d\n", a);//11
	//printf("%d\n", b);//10

	//int b = ++a;//前置++
	////先++，后使用
	////先给a++
	////a=11;
	////再将a的值赋给b
	////b=11;
	//printf("%d\n", a);//11
	//printf("%d\n", b);//11

	//int b = a--;//后置--
	////先使用，后--
	////先将a的值赋给b
	////b=10;
	////再--
	////a=9;
	//printf("%d\n", a);//9
	//printf("%d\n", b);//10

	int b = --a;//前置--
	//先--，后使用
	//先--
	//a=9;
	//再将a的值赋给b
	//b=9;
	printf("%d\n", a);//9
	printf("%d\n", b);//9


	system("pause");
	return 0;
}